src/cf/Catalogs/уатПунктыНазначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПунктыНазначения</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автостанция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступностиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступностиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гараж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаВМонопаллетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаВПаллетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолейАдреса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалВремениДляПоискаКоординат</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Comment>Комиссия (УАТ_Пассажирские перевозки)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент (УАТ_Пассажирские перевозки)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лат</Name>
					<Comment>Широта пункта назначения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лон</Name>
					<Comment>Долгота пункта назначения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельнаяГруппировкаПриКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РадиусПоиска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Comment>Страна (уэ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйКод</Name>
					<Comment>Телефонный код (уэ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПункта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыПунктов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрПункта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоянкаДоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоянкаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветНаКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропускнаяСпособностьСкладаТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропускнаяСпособностьСкладаКгЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропускнаяСпособностьСкладаЕдЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДляПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегВнеГеозоны</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелезнаяДорога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЖелезныеДороги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеТипыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоянкаДоп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатМаршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатМаршруты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеМаршрутаОднимПунктом</Name>
					<Comment>Ложь-пары пунктов, Истина-один пункт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Расстояние</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПланированияВАРМЛогиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУсловияРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСтатусыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветНаКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НочнойМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
					<Comment>Этапы движения по маршруту</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяВПути</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Comment>Пункт отправления</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктПрибытия</Name>
							<Comment>Пункт прибытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Comment>Расстояние</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочкиМаршрута</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/уатЭлектронныеКартыПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс 

// Функция возвращает скрипт для отображения карты
//
Функция ПолучитьСкрипт(ТипЭлектронныхКарт = Неопределено) Экспорт

	Возврат уатЗащищенныеФункцииСервер_проф.ПолучитьСкрипт(ТипЭлектронныхКарт);
	
КонецФункции

Функция ПолучитьСтрокуИнициализацииКоординаты(ПунктНазначения) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ПунктНазначения);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПунктыНазначения.Лат КАК Лат,
	|	уатПунктыНазначения.Лон КАК Лон
	|ИЗ
	|	Справочник.уатПунктыНазначения КАК уатПунктыНазначения
	|ГДЕ
	|	НЕ уатПунктыНазначения.ПометкаУдаления
	|	И уатПунктыНазначения.Ссылка = &Ссылка
	|	И НЕ(уатПунктыНазначения.Лат = 0
	|				И уатПунктыНазначения.Лон = 0)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Широта  = Выборка.Лат;
		Долгота = Выборка.Лон;
	Иначе 
		Широта  = 55.753318;
		Долгота = 37.620736;
	КонецЕсли;
	Координаты = Новый Структура("Широта, Долгота", Широта, Долгота);
	Возврат Координаты; 
	
КонецФункции

Функция ПолучитьПредставлениеАдресаOSM(ЗначенияПолейАдреса) Экспорт
	Возврат уатЭлектронныеКартыСервер.ПолучитьПредставлениеАдресаOSM(ЗначенияПолейАдреса);
КонецФункции

Функция ПолучитьТекстШаблонаПоУмолчанию(ВидОбъекта) Экспорт
	
	ТелоШаблона = ""; 
	Если ВидОбъекта = "ПунктыНазначения" Тогда 
		ТелоШаблона = НСТр("en = '<p><span style=""font-weight: bold;"">Point: <a href=""[уатПунктыНазначения.Ссылка]"" style=""font-weight: normal;"">[уатПунктыНазначения.Наименование]</a></p><p><span style=""font-weight: bold;"">Address:</span><span> [уатПунктыНазначения.Адрес]</span></p>'; ru = '<p><span style=""font-weight: bold;"">Пункт: <a href=""[уатПунктыНазначения.Ссылка]"" style=""font-weight: normal;"">[уатПунктыНазначения.Наименование]</a></p><p><span style=""font-weight: bold;"">Адрес:</span><span> [уатПунктыНазначения.Адрес]</span></p>'");
	ИначеЕсли ВидОбъекта = "Контрагенты" Тогда 
		ТелоШаблона = НСТр("en = '<p><span style=""font-weight: bold;"">Counterparty: <a href=""[Контрагенты.Ссылка]"" style=""font-weight: normal;"">[Контрагенты.Наименование]</a></p><p><span style=""font-weight: bold;"">Point:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p>'; ru = '<p><span style=""font-weight: bold;"">Контрагент: <a href=""[Контрагенты.Ссылка]"" style=""font-weight: normal;"">[Контрагенты.Наименование]</a></p><p><span style=""font-weight: bold;"">Пункт:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p>'");
	ИначеЕсли ВидОбъекта = "ТС" Тогда 
		ТелоШаблона = НСТр("en = '<p><span style=""font-weight: bold;"">Vehicle: <a href=""[уатТС.Ссылка]"" style=""font-weight: normal;"">[уатТС.Наименование]</a></p>'; ru = '<p><span style=""font-weight: bold;"">ТС: <a href=""[уатТС.Ссылка]"" style=""font-weight: normal;"">[уатТС.Наименование]</a></p>'");	
	ИначеЕсли ВидОбъекта = "Маршруты" Тогда
		ТелоШаблона = НСТр("en = '<p><span style=""font-weight: bold;"">Routes: <a href=""[уатМаршруты.Ссылка]"" style=""font-weight: normal;"">[уатМаршруты.Наименование]</a></p><p><span style=""font-weight: bold;"">Point:</span><span""> [ДанныеПункта.Пункт.Наименование]</span></p><p><span style=""font-weight: bold;"">Transaction:</span><span""> [ДанныеПункта.Операция]</span></p>'; ru = '<p><span style=""font-weight: bold;"">Маршруты: <a href=""[уатМаршруты.Ссылка]"" style=""font-weight: normal;"">[уатМаршруты.Наименование]</a></p><p><span style=""font-weight: bold;"">Пункт:</span><span""> [ДанныеПункта.Пункт.Наименование]</span></p><p><span style=""font-weight: bold;"">Операция:</span><span""> [ДанныеПункта.Операция]</span></p>'");
	ИначеЕсли ВидОбъекта = "ЗаказГрузоотправителя" Тогда 
		ТелоШаблона = НСТр("en = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Order for trucking: </span><a href=""[уатЗаказГрузоотправителя.Ссылка]"" style=""font-weight: normal;"">[уатЗаказГрузоотправителя.Номер] dated [уатЗаказГрузоотправителя.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Customer:     </span>[уатЗаказГрузоотправителя.Контрагент]</p><p style=""text-align: left;""><span style=""font-weight: bold;"">Point:           </span><span style=""font-weight: normal;"">[ДанныеПункта.Пункт.Наименование]</span></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Operation:    </span>[ДанныеПункта.ТипТочкиМаршрута]</p><p style=""text-align: left;""><span style=""font-weight: bold;"">Time window from: </span>[ДанныеПункта.ОкноС{ДФ=''dd.MM.yyyy HH:mm''}] to: [ДанныеПункта.ОкноПо{ДФ=''dd.MM.yyyy HH:mm''}]</p>'; ru = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Заказ на ТС: </span><a href=""[уатЗаказГрузоотправителя.Ссылка]"" style=""font-weight: normal;"">[уатЗаказГрузоотправителя.Номер] от [уатЗаказГрузоотправителя.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Заказчик:     </span>[уатЗаказГрузоотправителя.Контрагент]</p><p style=""text-align: left;""><span style=""font-weight: bold;"">Пункт:           </span><span style=""font-weight: normal;"">[ДанныеПункта.Пункт.Наименование]</span></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Операция:    </span>[ДанныеПункта.ТипТочкиМаршрута]</p><p style=""text-align: left;""><span style=""font-weight: bold;"">Временное окно с: </span>[ДанныеПункта.ОкноС{ДФ=''dd.MM.yyyy HH:mm''}] по [ДанныеПункта.ОкноПо{ДФ=''dd.MM.yyyy HH:mm''}]</p>'");
	ИначеЕсли ВидОбъекта = "МаршрутныйЛист" Тогда
		ТелоШаблона = НСТр("en = '<p><span style=""font-weight: bold;"">Point: </span>[ДанныеПункта.Пункт.Наименование]</p>
                            |<p><span style=""font-weight: bold;"">Document: </span>[ДанныеПункта.ПредставлениеМЛ]</p>
                            |<p><span style=""font-weight: bold;"">Vehicle:</span> [ДанныеПункта.ТС.Наименование]</p>
                            |<p><span style=""font-weight: bold;"">Arrival plan: </span>[ДанныеПункта.ПрибытиеПлан{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p><span style=""font-weight: bold;"">Arrival fact:</span> [ДанныеПункта.ПрибытиеФакт{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p><span style=""font-weight: bold;"">Delay:</span> <span style=""color: #ff0000;"">[ДанныеПункта.Опоздание]</span></p>
                            |<p><span style=""font-weight: bold;"">Deviation:</span> <span style=""color: #ff0000;"">[ДанныеПункта.ОтклонениеПрибытие]</span></p>
                            |<p style=""text-align: left;margin-left: 0pt;""><span style=""font-weight: bold;"">Departure plan:</span> [ДанныеПункта.УбытиеПлан{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p style=""text-align: left;""><span style=""font-weight: bold;"">Departure fact:</span> [ДанныеПункта.УбытиеФакт{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p style=""text-align: left;""><br></p>'; ru = '<p><span style=""font-weight: bold;"">Пункт: </span>[ДанныеПункта.Пункт.Наименование]</p>
                            |<p><span style=""font-weight: bold;"">Документ: </span>[ДанныеПункта.ПредставлениеМЛ]</p>
                            |<p><span style=""font-weight: bold;"">ТС:</span> [ДанныеПункта.ТС.Наименование]</p>
                            |<p><span style=""font-weight: bold;"">Прибытие план: </span>[ДанныеПункта.ПрибытиеПлан{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p><span style=""font-weight: bold;"">Прибытие факт:</span> [ДанныеПункта.ПрибытиеФакт{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p><span style=""font-weight: bold;"">Опоздание:</span> <span style=""color: #ff0000;"">[ДанныеПункта.Опоздание]</span></p>
                            |<p><span style=""font-weight: bold;"">Отклонение:</span> <span style=""color: #ff0000;"">[ДанныеПункта.ОтклонениеПрибытие]</span></p>
                            |<p style=""text-align: left;margin-left: 0pt;""><span style=""font-weight: bold;"">Убытие план:</span> [ДанныеПункта.УбытиеПлан{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p style=""text-align: left;""><span style=""font-weight: bold;"">Убытие факт:</span> [ДанныеПункта.УбытиеФакт{ДФ=''dd.MM.yyyy HH:mm''}]</p>
                            |<p style=""text-align: left;""><br></p>'");
	ИначеЕсли ВидОбъекта = "МаршрутныйЛистЗаказ" Тогда
		ТелоШаблона = НСТр("en = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Order for trucking: </span><a href=""[ДанныеЗаказа.Заказ.Ссылка]"" style=""font-weight: normal;"">[ДанныеЗаказа.Заказ.Номер] dated [ДанныеЗаказа.Заказ.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Operation:    </span>[ДанныеЗаказа.ТипТочкиМаршрута]</p><p style=""text-align: left;""><span style=""font-weight: bold;"">Time window from: </span>[ДанныеЗаказа.ОкноС{ДФ=''dd.MM.yyyy HH:mm''}] to [ДанныеЗаказа.ОкноПо{ДФ=''dd.MM.yyyy HH:mm''}]</p>'; ru = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Заказ на ТС: </span><a href=""[ДанныеЗаказа.Заказ.Ссылка]"" style=""font-weight: normal;"">[ДанныеЗаказа.Заказ.Номер] от [ДанныеЗаказа.Заказ.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Операция:    </span>[ДанныеЗаказа.ТипТочкиМаршрута]</p><p style=""text-align: left;""><span style=""font-weight: bold;"">Временное окно с: </span>[ДанныеЗаказа.ОкноС{ДФ=''dd.MM.yyyy HH:mm''}] по [ДанныеЗаказа.ОкноПо{ДФ=''dd.MM.yyyy HH:mm''}]</p>'");
	ИначеЕсли ВидОбъекта = "ПутевойЛист" Тогда
		ТелоШаблона = НСТр("en = '<p><span style=""font-weight: bold;"">Waybill: <a href=""[уатПутевойЛист.Ссылка]"" style=""font-weight: normal;"">[уатПутевойЛист.Номер] dated [уатПутевойЛист.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p><span style=""font-weight: bold;"">Point:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p><p><span style=""font-weight: bold;"">Arrival time:</span><span> [ДанныеПункта.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</span></p>'; ru = '<p><span style=""font-weight: bold;"">Путевой лист: <a href=""[уатПутевойЛист.Ссылка]"" style=""font-weight: normal;"">[уатПутевойЛист.Номер] от [уатПутевойЛист.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p><span style=""font-weight: bold;"">Пункт:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p><p><span style=""font-weight: bold;"">Время прибытия:</span><span> [ДанныеПункта.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</span></p>'");
	ИначеЕсли ВидОбъекта = "ЗаказТакси" Тогда 
		ТелоШаблона = НСТр("en = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Taxi order: </span><a href=""[такЗаказТакси.Ссылка]"" style=""font-weight: normal;"">[такЗаказТакси.Номер] dated [такЗаказТакси.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Customer:     </span>[такЗаказТакси.Заказчик]</p><p><span style=""font-weight: bold;"">Point:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p>'; ru = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Заказ такси: </span><a href=""[такЗаказТакси.Ссылка]"" style=""font-weight: normal;"">[такЗаказТакси.Номер] от [такЗаказТакси.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Заказчик:     </span>[такЗаказТакси.Заказчик]</p><p><span style=""font-weight: bold;"">Пункт:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p>'");
	ИначеЕсли ВидОбъекта = "АрендаТС" Тогда 
		ТелоШаблона = НСТр("en = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Vehicle rental: </span><a href=""[такАрендаТС.Ссылка]"" style=""font-weight: normal;"">[такАрендаТС.Номер] dated [такАрендаТС.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Customer:     </span>[такАрендаТС.Контрагент]</p><p><span style=""font-weight: bold;"">Point:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p>'; ru = '<p style=""text-align: left;""><span style=""font-weight: bold;"">Аренда ТС: </span><a href=""[такАрендаТС.Ссылка]"" style=""font-weight: normal;"">[такАрендаТС.Номер] от [такАрендаТС.Дата{ДФ=''dd.MM.yyyy HH:mm''}]</a></p><p style=""text-align: left;""><span style=""font-weight: bold;"">Заказчик:     </span>[такАрендаТС.Контрагент]</p><p><span style=""font-weight: bold;"">Пункт:</span><span> [ДанныеПункта.Пункт.Наименование]</span></p>'");
	КонецЕсли;
	ПолучитьТекстШаблонаHTML(ТелоШаблона);
	Возврат ТелоШаблона;
	
КонецФункции

Функция РазложитьСтрокуШаблонаВМассивПодстрок(ВидОбъекта) Экспорт 
	
	СоответвиеРезультат       = Новый Соответствие();
	МассивПодстрок            = Новый Массив();
	МассивРеквизиты           = Новый Массив();
	ИмяОбъекта                = "";
	ПолноеИмя                 = "";
	СтрокаРеквизитов          = "";
	СтрокаЗапроса             = "";
	СтрокаЗапросаДопПараметры = "";
	Шаблон                    = "";
	
	Если ВидОбъекта = "ПунктыНазначения" Тогда 
		ИмяОбъекта = "уатПунктыНазначения";
		ПолноеИмя  = "Справочник.уатПунктыНазначения";
	ИначеЕсли ВидОбъекта = "Контрагенты" Тогда
		ИмяОбъекта = "Контрагенты";
		ПолноеИмя  = "Справочник.Контрагенты";
	ИначеЕсли ВидОбъекта = "ТС" Тогда
		ИмяОбъекта = "уатТС";
		ПолноеИмя  = "Справочник.уатТС";
	ИначеЕсли ВидОбъекта = "Маршруты" Тогда 
		ИмяОбъекта = "уатМаршруты";
		ПолноеИмя  = "Справочник.уатМаршруты";
	ИначеЕсли ВидОбъекта = "ЗаказГрузоотправителя" Тогда 
		ИмяОбъекта = "уатЗаказГрузоотправителя";
		ПолноеИмя  = "Документ.уатЗаказГрузоотправителя";
	ИначеЕсли ВидОбъекта = "ПутевойЛист" Тогда
		ИмяОбъекта = "уатПутевойЛист";
		ПолноеИмя  = "Документ.уатПутевойЛист";
	ИначеЕсли ВидОбъекта = "МаршрутныйЛистЗаказ" Тогда 
		ИмяОбъекта = "уатЗаказГрузоотправителя";
		ПолноеИмя  = "Документ.уатЗаказГрузоотправителя";
	ИначеЕсли ВидОбъекта = "МаршрутныйЛист" Тогда
		ИмяОбъекта = "уатМаршрутныйЛист"; 
		ПолноеИмя  = "Документ.уатМаршрутныйЛист";
	КонецЕсли;
	
	НастройкиШаблонов = уатЭлектронныеКартыПовтИсп.ПолучитьНастройкиШаблоновИнформацииДляКарты();
	Если НастройкиШаблонов.Свойство(ВидОбъекта) Тогда  
		ШаблонСтроки = НастройкиШаблонов[ВидОбъекта];
	Иначе 
		ШаблонСтроки = ПолучитьТекстШаблонаПоУмолчанию(ВидОбъекта);
	КонецЕсли;
	ШаблонСтроки = СтрЗаменить(СтрЗаменить(ШаблонСтроки, "   ", "&nbsp;&nbsp;&nbsp;"), "  ", "&nbsp;&nbsp;");
	ШаблонСтроки = СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонСтроки, Символы.ПС, ""), "<p style=""", "<p style=""margin: 5px 0;"), "<p>", "<p style=""margin: 5px 0;"">");
	
	ТеМассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШаблонСтроки, "[");
	
	Индекс = 0;
	
	ТекстПостроитель = Новый ЗаписьXML;
	ТекстПостроитель.УстановитьСтроку();
	
	ТекстПостроительДопЗапрос = Новый ЗаписьXML;
	ТекстПостроительДопЗапрос.УстановитьСтроку();
	
	ТекстПостроительРеквизиты = Новый ЗаписьXML;
	ТекстПостроительРеквизиты.УстановитьСтроку();
	
	ТекстПостроительДопРеквизиты = Новый ЗаписьXML;
	ТекстПостроительДопРеквизиты.УстановитьСтроку();
	
	ЗаписыватьПарметр           = Ложь;
	ЗаписыватьПарметрЗапроса    = Ложь;
	ЗаписыватьПарметрДопЗапроса = Ложь;
	ЭтоСсылка = Ложь;
	ЕстьДопРеквизиты = Ложь;
	Для Каждого ТекСтрока Из ТеМассивПодстрок Цикл 
		МассивПодстрок.Добавить(ТекСтрока);
		ЭтоСсылка = СтрНайти(ТекСтрока, "<a href=""") <> 0;
		
		Если Индекс + 1 <= ТеМассивПодстрок.Количество() - 1 Тогда
			ПозицияПараметра = СтрНайти(ТеМассивПодстрок[Индекс + 1], "]");
			Параметр         =  Лев(ТеМассивПодстрок[Индекс + 1], ПозицияПараметра);
			ТеМассивПодстрок[Индекс + 1] = СтрЗаменить(ТеМассивПодстрок[Индекс + 1], Параметр, "");
			МассивПодстрок.Добавить("[" + Параметр); 
			
			ТекПараметр = СоответвиеРезультат.Получить("[" + Параметр);
			Если ТекПараметр = Неопределено Тогда
				ТекПараметр = Новый Структура("МассивИндексов, МассивИндексовСсылок, Имя, Значение, СтрокаФормата",
					Новый Массив, Новый Массив, "", "", ""); 
			КонецЕсли; 
			Если ЭтоСсылка Тогда
				ТекПараметр.МассивИндексовСсылок.Добавить(МассивПодстрок.Количество() - 1);
			Иначе
				ТекПараметр.МассивИндексов.Добавить(МассивПодстрок.Количество() - 1);
			КонецЕсли;
			ПозицияФормат = СтрНайти(Параметр, "{");
			Если ПозицияФормат > 0 Тогда
				ИмяПараметра  = Лев(Параметр, ПозицияФормат - 1); 
				СтрокаФормата = Сред(Параметр, ПозицияФормат + 1, СтрДлина(Параметр) - СтрДлина(ИмяПараметра) -3);
			Иначе 
				ПозицияОкончание = СтрНайти(Параметр, "]");
				
				ИмяПараметра  = Лев(Параметр, ПозицияОкончание - 1);
				СтрокаФормата = "";
			КонецЕсли; 
			ТекПараметр.Имя           = ИмяПараметра;
			ТекПараметр.СтрокаФормата = СтрокаФормата;
			
			Если МассивРеквизиты.Найти(ТекПараметр.Имя)= Неопределено Тогда
				Если СтрНайти(ИмяПараметра, ИмяОбъекта + ".") <> 0 Тогда 
					Если СтрНайти(ИмяПараметра, "~Свойство") <> 0
						ИЛИ СтрНайти(ИмяПараметра, "~КИ") <> 0 Тогда  
						ЕстьДопРеквизиты = Истина; 
					Иначе
						Если ЗаписыватьПарметрЗапроса Тогда 
							ТекстПостроитель.ЗаписатьБезОбработки(",");
							ТекстПостроительРеквизиты.ЗаписатьБезОбработки(",");
							
							ЗаписыватьПарметрЗапроса = Ложь;
						КонецЕсли;
						
						ТекРеквизитБезПробелов = СтрЗаменить(ИмяПараметра, " ", "");
						ТекРеквизитБезТочек    = СтрЗаменить(ИмяПараметра, ".", "");
						ТекстПостроитель.ЗаписатьБезОбработки("ПРЕДСТАВЛЕНИЕССЫЛКИ(");
						ТекстПостроитель.ЗаписатьБезОбработки(ТекРеквизитБезПробелов);
						ТекстПостроитель.ЗаписатьБезОбработки(")");
						ТекстПостроитель.ЗаписатьБезОбработки(" КАК ");
						ТекстПостроитель.ЗаписатьБезОбработки(ТекРеквизитБезТочек);
						
						ТекстПостроительРеквизиты.ЗаписатьБезОбработки(ТекРеквизитБезТочек);
						
						ТекстПостроитель.ЗаписатьБезОбработки(",");
						ТекстПостроитель.ЗаписатьБезОбработки(ТекРеквизитБезПробелов);
						ТекстПостроитель.ЗаписатьБезОбработки(" КАК ");
						ТекстПостроитель.ЗаписатьБезОбработки(ТекРеквизитБезТочек);
						ТекстПостроитель.ЗаписатьБезОбработки("Ссылка");
						
						ТекстПостроительРеквизиты.ЗаписатьБезОбработки(",");
						ТекстПостроительРеквизиты.ЗаписатьБезОбработки(ТекРеквизитБезТочек); 
						ТекстПостроительРеквизиты.ЗаписатьБезОбработки("Ссылка");
						
						ЗаписыватьПарметрЗапроса = Истина;
					КонецЕсли;
				Иначе   
					Если СтрНайти(ИмяПараметра, "~Свойство") <> 0 
						ИЛИ СтрНайти(ИмяПараметра, "~КИ") <> 0 Тогда  
						ЕстьДопРеквизиты = Истина; 
					Иначе
						Если ЗаписыватьПарметрДопЗапроса Тогда 
							ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(",");
							ТекстПостроительДопРеквизиты.ЗаписатьБезОбработки(",");
							ЗаписыватьПарметрДопЗапроса = Ложь;
						КонецЕсли; 
						
						ТекРеквизитБезПробелов = СтрЗаменить(ИмяПараметра, " ", "");
						ТекРеквизитБезТочек    = СтрЗаменить(ИмяПараметра, ".", "");
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки("ПРЕДСТАВЛЕНИЕССЫЛКИ(");
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(ТекРеквизитБезПробелов);
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(")");
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(" КАК ");
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(ТекРеквизитБезТочек);
						
						ТекстПостроительДопРеквизиты.ЗаписатьБезОбработки(ТекРеквизитБезТочек);
						
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(",");
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(ТекРеквизитБезПробелов);
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(" КАК ");
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки(ТекРеквизитБезТочек);
						ТекстПостроительДопЗапрос.ЗаписатьБезОбработки("Ссылка");
						
						ТекстПостроительДопРеквизиты.ЗаписатьБезОбработки(",");
						ТекстПостроительДопРеквизиты.ЗаписатьБезОбработки(ТекРеквизитБезТочек); 
						ТекстПостроительДопРеквизиты.ЗаписатьБезОбработки("Ссылка");
						
						ЗаписыватьПарметрДопЗапроса = Истина;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;

			МассивРеквизиты.Добавить(ТекПараметр.Имя);
			СоответвиеРезультат.Вставить("[" + Параметр, ТекПараметр); 
			
			Если Индекс + 1 = ТеМассивПодстрок.Количество() - 1 Тогда 
				МассивПодстрок.Добавить(ТеМассивПодстрок[Индекс + 1]);
				Прервать;
			КонецЕсли;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	СтрокаЗапроса             = ТекстПостроитель.Закрыть(); 
	СтрокаЗапросаДопПараметры = ТекстПостроительДопЗапрос.Закрыть();
	СтрокаРеквизитов          = ТекстПостроительРеквизиты.Закрыть();
	СтрокаДопРеквизитов       = ТекстПостроительДопРеквизиты.Закрыть();

	Возврат Новый Структура("МассивПодстрок, МассивРеквизиты, СоответвиеПараметров, ИмяОбъектаМетаданных,
	|ПолноеИмяОбъектаМетаданных, СтрокаРеквизитов, СтрокаДопРеквизитов, СтрокаЗапроса, СтрокаЗапросаДопПараметры, Шаблон, ЕстьДопРеквизиты",
		МассивПодстрок, МассивРеквизиты, СоответвиеРезультат, ИмяОбъекта, ПолноеИмя, СтрокаРеквизитов, СтрокаДопРеквизитов, 
		СтрокаЗапроса, СтрокаЗапросаДопПараметры, ШаблонСтроки, ЕстьДопРеквизиты);
КонецФункции

Функция ОпределитьПараметрыТекстаСообщения(ТекстСообщения) Экспорт
	
	МассивПараметров = Новый Соответствие;
	
	ДлинаСообщения = СтрДлина(ТекстСообщения);
	
	Текст = ТекстСообщения;
	Позиция = СтрНайти(Текст, "[");
	Пока Позиция > 0 Цикл
		Если Позиция + 1 > ДлинаСообщения Тогда
			Прервать;
		КонецЕсли;
		ПозицияОкончание = СтрНайти(Текст, "]", НаправлениеПоиска.СНачала, Позиция + 1);
		Если ПозицияОкончание > 0 Тогда
			НайденныйПараметр = Сред(Текст, Позиция + 1, ПозицияОкончание - Позиция - 1);
			МассивПараметров.Вставить(НайденныйПараметр, "");
		ИначеЕсли ПозицияОкончание = 0 Тогда
			ПозицияОкончание = Позиция + 1;
		КонецЕсли;
		Если ПозицияОкончание > ДлинаСообщения Тогда
			Прервать;
		КонецЕсли;
		Позиция = СтрНайти(Текст, "[", НаправлениеПоиска.СНачала, ПозицияОкончание);
	КонецЦикла;
	
	СоответствиеПараметров = Новый Соответствие;
	Для каждого ЭлементаМассиваПараметров Из МассивПараметров Цикл
		ПозицияФормат = СтрНайти(ЭлементаМассиваПараметров.Ключ, "{");
		Если ПозицияФормат > 0 Тогда
			ИмяПараметра  = Лев(ЭлементаМассиваПараметров.Ключ, ПозицияФормат - 1);
			СтрокаФормата = Сред(ЭлементаМассиваПараметров.Ключ, ПозицияФормат );
		Иначе
			ИмяПараметра  = ЭлементаМассиваПараметров.Ключ;
			СтрокаФормата = "";
		КонецЕсли;
		МассивРазобранныйПараметр = СтрРазделить(ИмяПараметра, ".", Ложь);
		Если МассивРазобранныйПараметр.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьЭлементСоответствия(СоответствиеПараметров, МассивРазобранныйПараметр, СтрокаФормата);
	КонецЦикла;
	
	Возврат СоответствиеПараметров;
	
КонецФункции

Процедура УстановитьЭлементСоответствия(СоответствиеПараметров, Знач МассивРазобранныйПараметр, СтрокаФормата)
	ЭлементСоответствия = СоответствиеПараметров.Получить(МассивРазобранныйПараметр[0]);
	Если ЭлементСоответствия = Неопределено Тогда
		Если МассивРазобранныйПараметр.Количество() > 1 Тогда
			ВнутреннийЭлементСоответствия = Новый Соответствие;
			СоответствиеПараметров.Вставить(МассивРазобранныйПараметр[0], ВнутреннийЭлементСоответствия);
			МассивРазобранныйПараметр.Удалить(0);
			УстановитьЭлементСоответствия(ВнутреннийЭлементСоответствия, МассивРазобранныйПараметр, СтрокаФормата)
		Иначе
			Если СоответствиеПараметров[МассивРазобранныйПараметр[0] + СтрокаФормата] = Неопределено Тогда
				СоответствиеПараметров.Вставить(МассивРазобранныйПараметр[0] + СтрокаФормата, "");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если МассивРазобранныйПараметр.Количество() > 1 Тогда
			МассивРазобранныйПараметр.Удалить(0);
			УстановитьЭлементСоответствия(ЭлементСоответствия, МассивРазобранныйПараметр, СтрокаФормата)
		Иначе
			Если СоответствиеПараметров[МассивРазобранныйПараметр[0] + СтрокаФормата] = Неопределено Тогда
				СоответствиеПараметров.Вставить(МассивРазобранныйПараметр[0] + СтрокаФормата, "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТекстШаблонаHTML(Шаблон) 
	Возврат уатЭлектронныеКартыСервер.ПолучитьТекстШаблонаHTML(Шаблон);
КонецФункции

Функция ЭкранироватьСимволы(СтрокаЭкранирования) Экспорт
	Если СтрНайти(СтрокаЭкранирования, """") Тогда
		СтрокаЭкранирования = СтрЗаменить(СтрокаЭкранирования, """","\""");
	КонецЕсли;
	Если СтрНайти(СтрокаЭкранирования, "'") Тогда
		СтрокаЭкранирования = СтрЗаменить(СтрокаЭкранирования, "'", "\'");
	КонецЕсли;
	Если СтрНайти(СтрокаЭкранирования, "&") Тогда
		СтрокаЭкранирования = СтрЗаменить(СтрокаЭкранирования,"&", "\&");
	КонецЕсли;
	Если СтрНайти(СтрокаЭкранирования, "<") Тогда
		СтрокаЭкранирования = СтрЗаменить(СтрокаЭкранирования,"<", "\<");
	КонецЕсли;
	Если СтрНайти(СтрокаЭкранирования, ">") Тогда
		СтрокаЭкранирования = СтрЗаменить(СтрокаЭкранирования,">", "\>");
	КонецЕсли;
	Возврат СтрокаЭкранирования;
КонецФункции

Функция ПолучитьНастройкиШаблоновИнформацииДляКарты() Экспорт
	ХранилищеШаблонов = Константы.уатНастройкиШаблоновИнформацииДляКарты.Получить(); 
	Если ХранилищеШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Неопределено;
	Иначе 
		НастройкиШаблонов = ХранилищеШаблонов.Получить();
	КонецЕсли;
	
	Если НастройкиШаблонов = Неопределено Тогда 
		НастройкиШаблонов = Новый Структура();
	КонецЕсли;
	Возврат НастройкиШаблонов;
КонецФункции

// Функция возвращает объект "Цвет" по индексу из массива досутпных цветов.
//
// Параметры:
//  ИндексЦвета - Число - индекс цвета в массиве.
// 
// Возвращаемое значение:
//   - Цвет.
//
Функция ПолучитьЦветДокументаПоКоллекции(Знач НомерЦвета) Экспорт
	
	МассивЦветов = ПолучитьМассивЦветов();
	
	ИндексЦвета = НомерЦвета - 1;
	
	Если ИндексЦвета > 15 Или ИндексЦвета < 0 Тогда 
		Возврат Новый Цвет();
	Иначе 
		Возврат МассивЦветов[ИндексЦвета];
	КонецЕсли;
	
КонецФункции // ПолучитьЦветДокументаПоКоллекции()

// Функция предназначена для получения массива доступных цветов.
// 
// Возвращаемое значение:
//   - Массив доступных цветов.
//
Функция ПолучитьМассивЦветов() Экспорт
	
	МассивЦветов = Новый Массив();
	
	// Синий.
	МассивЦветов.Добавить(Новый Цвет(30, 152, 255));
	
	// Красный.
	МассивЦветов.Добавить(Новый Цвет(237, 69, 67));
	
	// Темно-оранжевый.
	МассивЦветов.Добавить(Новый Цвет(230, 118, 27));
	
	// Ночной.
	МассивЦветов.Добавить(Новый Цвет(14, 71, 121));
	
	// Темно-синий.
	МассивЦветов.Добавить(Новый Цвет(23, 123, 201));
	
	// Розовый.
	МассивЦветов.Добавить(Новый Цвет(243, 113, 209));
	
	// Серый.
	МассивЦветов.Добавить(Новый Цвет(179, 179, 179));
	
	// Коричневый.
	МассивЦветов.Добавить(Новый Цвет(121, 61, 14));
	
	// Темно-зеленый.
	МассивЦветов.Добавить(Новый Цвет(27, 173, 3));
	
	// Фиолетовый.
	МассивЦветов.Добавить(Новый Цвет(181, 30, 255));
	
	// Черный.
	МассивЦветов.Добавить(Новый Цвет(89, 89, 89));
	
	// Желтый.
	МассивЦветов.Добавить(Новый Цвет(255, 210, 30));
	
	// Зеленый.
	МассивЦветов.Добавить(Новый Цвет(86, 219, 64));
	
	// Оранжевый.
	МассивЦветов.Добавить(Новый Цвет(255, 147, 30));
	
	// Светло-синий.
	МассивЦветов.Добавить(Новый Цвет(130, 205, 255));
	
	// Оливковый.
	МассивЦветов.Добавить(Новый Цвет(151, 161, 0));
	
	Возврат МассивЦветов;
	
КонецФункции // ПолучитьМассивЦветов()

Функция ПолучитьЦветLeaflet(Знач Красный, Знач Зеленый, Знач Синий) Экспорт
	
	ЦветСтр = "#"+ДесятичноеВШестнадцатеричное(Красный)+ДесятичноеВШестнадцатеричное(Зеленый)+ДесятичноеВШестнадцатеричное(Синий);
	
	Возврат ЦветСтр;
	
КонецФункции

Функция ПолучитьИзображениеИзТипаПункта(ТекстМакета, ЦветИзображения) Экспорт
	Если ЦветИзображения <> "" Тогда
		СтрокаПоиска = "fill=";
		СтрокаПоиска1 = """";
		СтрокаПоиска2 = """";
		ЧислоВхождений = СтрЧислоВхождений(ТекстМакета, СтрокаПоиска);
		fillОбласти    = СтрНайти(ТекстМакета, "<path");
		Если ЧислоВхождений = 0 Тогда
			СтрокаПоиска   = "fill:";
			ЧислоВхождений = СтрЧислоВхождений(ТекстМакета, СтрокаПоиска);
			
			СтрокаПоиска1 = ":";
			СтрокаПоиска2 = ";";
		КонецЕсли;
		
		Для Счетчик = 1 По ЧислоВхождений Цикл
			fillОбласти = СтрНайти(ТекстМакета, СтрокаПоиска,,fillОбласти+1);
			Если fillОбласти <> 0 Тогда
				
				Если СтрокаПоиска1 = ":" Тогда 
					НачальнаяПозицияКонцаfillОбласти1 = СтрНайти(ТекстМакета, СтрокаПоиска1,,fillОбласти);
				Иначе
					НачальнаяПозицияКонцаfillОбласти1 = СтрНайти(ТекстМакета, СтрокаПоиска1,,fillОбласти );
				КонецЕсли;
				НачальнаяПозицияКонцаfillОбласти2 = СтрНайти(ТекстМакета, СтрокаПоиска2,,
				НачальнаяПозицияКонцаfillОбласти1 + 1);
				
				Цвет = Сред(ТекстМакета, НачальнаяПозицияКонцаfillОбласти1 + 1, НачальнаяПозицияКонцаfillОбласти2 - НачальнаяПозицияКонцаfillОбласти1 - 1);
				
				Если Цвет = "rgb(100%,100%,100%)"
					ИЛИ Цвет = "white" Тогда
					Продолжить;
				КонецЕсли;
				
				НачалоСтроки = Лев(ТекстМакета, НачальнаяПозицияКонцаfillОбласти1) + ЦветИзображения;
				ОкончаниеСтроки = Сред(ТекстМакета, НачальнаяПозицияКонцаfillОбласти2, СтрДлина(ТекстМакета));
				
				ТекстМакета = НачалоСтроки + ОкончаниеСтроки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ДвоичныеДанныеМакета = ПолучитьДвоичныеДанныеИзСтроки(ТекстМакета);
	
	ИзображениеИзМакета  = Новый Картинка(ДвоичныеДанныеМакета);
	
	Возврат ИзображениеИзМакета;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДесятичноеВШестнадцатеричное(Знач дЧисло)
	
	Если дЧисло = 0 Тогда 
		Возврат "00";
	КонецЕсли;
	
	База = 16;
	Результат = "";
	Пока дЧисло <> 0 Цикл
		Поз =дЧисло % База;
		Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
		дЧисло = Цел(дЧисло / База);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда 
		Возврат "0" + Результат;
	Иначе 
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
